<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"1a56f57402124c3070b57af3149102c988f4232494a489861daa27926ee002e2","plan_job_ref":"Job Create Terraform plan (DEV) #162 at https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15196259125","plan_out_hash":"8e49d46fc8134576ddf04da4b511c8e55561c1656afdbcb7ab9e109855b739e9","plan_hash":"4c9e6d899fe50a162a31f39c6b8eb39ed8aa67c6a105dfd9dd4fe363c139e9e2","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __terraform/dev/__
<details>
<summary>Plan: 4 to add, 2 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.aks will be updated in-place
!~  resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/c2b90606-cc96-463f-aa06-70f32719fe4f/resourceGroups/rg-openmrscore-dev/providers/Microsoft.ContainerService/managedClusters/openmrs-dev-audioprothese-aks"
        name                                = "openmrs-dev-audioprothese-aks"
        tags                                = {
            "Environment"  = "dev"
            "organization" = "audioprothese"
            "project"      = "openmrs"
        }
#        (31 unchanged attributes hidden)

!~      default_node_pool {
            name                          = "default"
            tags                          = {}
#            (30 unchanged attributes hidden)

-           upgrade_settings {
-               drain_timeout_in_minutes      = 0 -> null
-               max_surge                     = "10%" -> null
-               node_soak_duration_in_minutes = 0 -> null
            }
        }

#        (4 unchanged blocks hidden)
    }

  # helm_release.oauth2_proxy is tainted, so must be replaced
-/+ resource "helm_release" "oauth2_proxy" {
!~      id                         = "************" -> (known after apply)
+       manifest                   = (known after apply)
!~      metadata                   = [
-           {
-               app_version    = "7.9.0"
-               chart          = "oauth2-proxy"
-               first_deployed = 1747941840
-               last_deployed  = 1747945326
-               name           = "oauth2-proxy"
-               namespace      = "authgate"
-               notes          = <<-EOT
                    To verify that oauth2-proxy has started, run:
                    
                      kubectl --namespace=authgate get pods -l "app=oauth2-proxy"
                EOT
-               revision       = 3
-               values         = jsonencode(
                    {
-                       config             = {
-                           existingSecret = "oauth2-proxy-secret"
                        }
-                       extraArgs          = [
-                           "--provider=oidc",
-                           "--oidc-issuer-url=https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/v2.0",
-                           "--scope=openid email profile",
-                           "--email-domain=*",
-                           "--redirect-url=https://oauth2.dev.audioprothese.ovh/oauth2/callback",
-                           "--skip-provider-button",
-                           "--reverse-proxy",
-                           "--cookie-secure=true",
-                           "--cookie-domain=.audioprothese.ovh",
-                           "--cookie-name=_oauth2_proxy",
-                           "--cookie-refresh=2m",
-                           "--cookie-expire=24h",
-                           "--whitelist-domain=.audioprothese.ovh",
-                           "--set-authorization-header=false",
-                           "--pass-access-token=false",
-                           "--pass-user-headers=true",
-                           "--set-xauthrequest=true",
-                           "--oidc-email-claim=preferred_username",
                        ]
-                       ingress            = {
-                           annotations = {
-                               "cert-manager.io/cluster-issuer"                 = "letsencrypt-prod"
-                               "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                            }
-                           className   = "webapprouting.kubernetes.azure.com"
-                           enabled     = true
-                           hosts       = [
-                               "oauth2.dev.audioprothese.ovh",
                            ]
-                           path        = "/oauth2"
-                           pathType    = "Prefix"
-                           tls         = [
-                               {
-                                   hosts      = [
-                                       "oauth2.dev.audioprothese.ovh",
                                    ]
-                                   secretName = "oauth2-tls"
                                },
                            ]
                        }
-                       initContainers     = {
-                           waitForRedis = {
-                               enabled = false
                            }
                        }
-                       proxyVarsAsSecrets = true
-                       redis              = {
-                           enabled = true
                        }
-                       service            = {
-                           portNumber = 4180
-                           type       = "ClusterIP"
                        }
-                       sessionStorage     = {
-                           redis = {
-                               clientType = "standalone"
-                               standalone = {
-                                   connectionUrl = "redis://oauth2-proxy-redis-master:6379/0"
                                }
                            }
-                           type  = "redis"
                        }
                    }
                )
-               version        = "7.12.13"
            },
        ] -> (known after apply)
        name                       = "oauth2-proxy"
!~      values                     = [
!~          <<-EOT
                proxyVarsAsSecrets: true
                
                sessionStorage:
                  type: redis
                  redis:
                    clientType: standalone
                    standalone:
                      connectionUrl: redis://oauth2-proxy-redis-master:6379/0
                
                initContainers:
                  waitForRedis:
                    enabled: false
                
                redis:
                  enabled: true
                
                config:
                  existingSecret: oauth2-proxy-secret
                
                extraArgs:
                  - --provider=oidc
                  - --oidc-issuer-url=https://login.microsoftonline.com/8a25df97-9f2b-4ef1-a9e7-3faf585640e8/v2.0
                  - --scope=openid email profile
                  - --email-domain=*
                  - --redirect-url=https://oauth2.dev.audioprothese.ovh/oauth2/callback
                  - --skip-provider-button
                  - --reverse-proxy
                  - --cookie-secure=true
                  - --cookie-domain=.audioprothese.ovh
                  - --cookie-name=_oauth2_proxy
                  - --cookie-refresh=2m
                  - --cookie-expire=24h
                  - --whitelist-domain=.audioprothese.ovh
              -   - --set-authorization-header=false         
              +   - --set-authorization-header=false        
                  - --pass-access-token=false               
              -   - --pass-user-headers=false                
              +   - --pass-user-headers=true              
              -   - --set-xauthrequest=false               
              +   - --set-xauthrequest=true               
                  - --oidc-email-claim=preferred_username
                
                ingress:
                  enabled: true
                  className: webapprouting.kubernetes.azure.com
                  annotations:
                    cert-manager.io/cluster-issuer: letsencrypt-prod
                    nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                  hosts:
                    - oauth2.dev.audioprothese.ovh
                  path: /oauth2
                  pathType: Prefix
                  tls:
                    - secretName: oauth2-tls
                      hosts:
                        - oauth2.dev.audioprothese.ovh
                
                service:
                  type: ClusterIP
                  portNumber: 4180
            EOT,
        ]
#        (26 unchanged attributes hidden)
    }

  # helm_release.openmrs is tainted, so must be replaced
-/+ resource "helm_release" "openmrs" {
!~      id                         = "*******" -> (known after apply)
+       manifest                   = (known after apply)
!~      metadata                   = [
-           {
-               app_version    = "3.1.0"
-               chart          = "openmrs"
-               first_deployed = 1747941840
-               last_deployed  = 1747941840
-               name           = "openmrs"
-               namespace      = "openmrs"
-               notes          = <<-EOT
                    CHART NAME: mariadb
                    CHART VERSION: 19.0.5
                    APP VERSION: 11.4.3
                    
                    ** Please be patient while the chart is being deployed **
                    
                    Tip:
                    
                      Watch the deployment status using the command: kubectl get pods -w --namespace openmrs -l app.kubernetes.io/instance=openmrs
                    
                    Services:
                    
                      echo Primary: openmrs-mariadb-primary.openmrs.svc.cluster.local:3306
                      echo Secondary: openmrs-mariadb-secondary.openmrs.svc.cluster.local:3306
                    
                    Administrator credentials:
                    
                      Username: root
                      Password : $(kubectl get secret --namespace openmrs openmrs-mariadb -o jsonpath="{.data.mariadb-root-password}" | base64 -d)
                    
                    To connect to your database:
                    
                      1. Run a pod that you can use as a client:
                    
                          kubectl run openmrs-mariadb-client --rm --tty -i --restart='Never' --image  docker.io/bitnami/mariadb:10.11 --namespace openmrs --command -- bash
                    
                      2. To connect to primary service (read/write):
                    
                          mysql -h openmrs-mariadb-primary.openmrs.svc.cluster.local -uroot -p openmrs
                    
                      3. To connect to secondary service (read-only):
                    
                          mysql -h openmrs-mariadb-secondary.openmrs.svc.cluster.local -uroot -p openmrs
                    
                    To upgrade this helm chart:
                    
                      1. Obtain the password as described on the 'Administrator credentials' section and set the 'auth.rootPassword' parameter as shown below:
                    
                          ROOT_PASSWORD=$(kubectl get secret --namespace openmrs openmrs-mariadb -o jsonpath="{.data.mariadb-root-password}" | base64 -d)
                          helm upgrade --namespace openmrs openmrs oci://registry-1.docker.io/bitnamicharts/mariadb --set auth.rootPassword=$ROOT_PASSWORD
                    WARNING: Rolling tag detected (bitnami/mariadb:10.11), please note that it is strongly recommended to avoid using rolling tags in a production environment.
                    +info https://docs.vmware.com/en/VMware-Tanzu-Application-Catalog/services/tutorials/GUID-understand-rolling-tags-containers-index.html
                    
                    WARNING: There are "resources" sections in the chart not set. Using "resourcesPreset" is not recommended for production. For production installations, please set the following values according to your workload needs:
                      - primary.resources
                      - secondary.resources
                    +info https://kubernetes.io/docs/concepts/configuration/manage-resources-containers/
                    
                    ⚠ SECURITY WARNING: Original containers have been substituted. This Helm chart was designed, tested, and validated on multiple platforms using a specific set of Bitnami and Tanzu Application Catalog containers. Substituting other containers is likely to cause degraded security and performance, broken chart features, and missing environment variables.
                    
                    Substituted images detected:
                      - docker.io/bitnami/mariadb:%!s(float64=10.11)
                    OpenMRS Gateway has been successfully deployed!
                    
                    Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace openmrs -l "app.kubernetes.io/name=openmrs-gateway,app.kubernetes.io/instance=openmrs" -o jsonpath="{.items[0].metadata.name}")
                      export CONTAINER_PORT=$(kubectl get pod --namespace openmrs $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                      echo "Visit http://127.0.0.1:8080 to use your application"
                      kubectl --namespace openmrs port-forward $POD_NAME 8080:$CONTAINER_PORT
                    
                    OpenMRS Backend has been successfully deployed!
                    
                    Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace openmrs -l "app.kubernetes.io/name=openmrs-backend,app.kubernetes.io/instance=openmrs" -o jsonpath="{.items[0].metadata.name}")
                      export CONTAINER_PORT=$(kubectl get pod --namespace openmrs $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                      echo "Visit http://127.0.0.1:8080 to use your application"
                      kubectl --namespace openmrs port-forward $POD_NAME 8080:$CONTAINER_PORT
                    
                    OpenMRS has been successfully deployed!
                    
                    It may take a few minutes for the OpenMRS application to be accessible. You can watch the status by running
                    and waiting for all pods to be ready:
                    
                    kubectl get pods --namespace openmrs
                    
                    Get the application URL by running these commands:
                      export NODE_PORT=$(kubectl get --namespace openmrs -o jsonpath="{.spec.ports[0].nodePort}" services openmrs)
                      export NODE_IP=$(kubectl get nodes --namespace openmrs -o jsonpath="{.items[0].status.addresses[0].address}")
                      echo http://$NODE_IP:$NODE_PORT
                    
                    OpenMRS Frontend has been successfully deployed!
                    
                    Get the application URL by running these commands:
                      export POD_NAME=$(kubectl get pods --namespace openmrs -l "app.kubernetes.io/name=openmrs-frontend,app.kubernetes.io/instance=openmrs" -o jsonpath="{.items[0].metadata.name}")
                      export CONTAINER_PORT=$(kubectl get pod --namespace openmrs $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                      echo "Visit http://127.0.0.1:8080 to use your application"
                      kubectl --namespace openmrs port-forward $POD_NAME 8080:$CONTAINER_PORT
                EOT
-               revision       = 1
-               values         = jsonencode(
                    {
-                       global           = {
-                           defaultStorageClass = "default"
                        }
-                       openmrs-backend  = {
-                           image = {
-                               repository = "openmrsacrdev.azurecr.io/openmrscore-backend"
-                               tag        = "latest"
                            }
                        }
-                       openmrs-frontend = {
-                           image = {
-                               repository = "openmrsacrdev.azurecr.io/openmrscore-frontend"
-                               tag        = "latest"
                            }
                        }
-                       openmrs-gateway  = {
-                           image   = {
-                               repository = "openmrsacrdev.azurecr.io/openmrscore-gateway"
-                               tag        = "latest"
                            }
-                           service = {
-                               port = 80
-                               type = "ClusterIP"
                            }
                        }
                    }
                )
-               version        = "0.1.5"
            },
        ] -> (known after apply)
        name                       = "openmrs"
!~      status                     = "failed" -> "deployed"
#        (26 unchanged attributes hidden)
    }

  # helm_release.prometheus-stack will be updated in-place
!~  resource "helm_release" "prometheus-stack" {
        id                         = "prometheus-stack"
!~      metadata                   = [
-           {
-               app_version    = "v0.82.2"
-               chart          = "kube-prometheus-stack"
-               first_deployed = 1747941853
-               last_deployed  = 1747944400
-               name           = "prometheus-stack"
-               namespace      = "monitoring"
-               notes          = <<-EOT
                    kube-prometheus-stack has been installed. Check its status by running:
                      kubectl --namespace monitoring get pods -l "release=prometheus-stack"
                    
                    Get Grafana 'admin' user password by running:
                    
                      kubectl --namespace monitoring get secrets prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 -d ; echo
                    
                    Access Grafana local instance:
                    
                      export POD_NAME=$(kubectl --namespace monitoring get pod -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=prometheus-stack" -oname)
                      kubectl --namespace monitoring port-forward $POD_NAME 3000
                    
                    Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
                EOT
-               revision       = 2
-               values         = jsonencode(
                    {
-                       alertmanager = {
-                           ingress = {
-                               enabled          = true
-                               hosts            = [
-                                   "alertmanager.dev.audioprothese.ovh",
                                ]
-                               ingressClassName = "webapprouting.kubernetes.azure.com"
-                               path             = "/"
-                               pathType         = "Prefix"
                            }
                        }
-                       grafana      = {
-                           datasources   = {
-                               "datasources.yaml" = {
-                                   apiVersion  = 1
-                                   datasources = [
-                                       {
-                                           name = "Loki"
-                                           type = "loki"
-                                           url  = "http://loki-gateway.loki.svc.cluster.local/"
                                        },
                                    ]
                                }
                            }
-                           "grafana.ini" = {
-                               auth         = {
-                                   disable_login_form = true
                                }
-                               "auth.proxy" = {
-                                   auto_sign_up    = true
-                                   enabled         = true
-                                   header_name     = "X-Auth-Request-Email"
-                                   header_property = "email"
                                }
-                               server       = {
-                                   domain   = "grafana.dev.audioprothese.ovh"
-                                   root_url = "https://grafana.dev.audioprothese.ovh/"
                                }
-                               users        = {
-                                   auto_assign_org      = true
-                                   auto_assign_org_role = "Admin"
                                }
                            }
-                           ingress       = {
-                               annotations      = {
-                                   "cert-manager.io/cluster-issuer"                    = "letsencrypt-prod"
-                                   "nginx.ingress.kubernetes.io/auth-response-headers" = "X-Auth-Request-User, X-Auth-Request-Email"
-                                   "nginx.ingress.kubernetes.io/auth-signin"           = "https://oauth2.dev.audioprothese.ovh/oauth2/start?rd=$scheme://$host$escaped_request_uri"
-                                   "nginx.ingress.kubernetes.io/auth-url"              = "https://oauth2.dev.audioprothese.ovh/oauth2/auth"
-                                   "nginx.ingress.kubernetes.io/force-ssl-redirect"    = "true"
                                }
-                               enabled          = true
-                               hosts            = [
-                                   "grafana.dev.audioprothese.ovh",
                                ]
-                               ingressClassName = "webapprouting.kubernetes.azure.com"
-                               labels           = {}
-                               path             = "/"
-                               pathType         = "Prefix"
-                               tls              = [
-                                   {
-                                       hosts      = [
-                                           "grafana.dev.audioprothese.ovh",
                                        ]
-                                       secretName = "grafana-tls"
                                    },
                                ]
                            }
                        }
-                       prometheus   = {
-                           ingress = {
-                               annotations      = {
-                                   "cert-manager.io/cluster-issuer"                 = "letsencrypt-prod"
-                                   "nginx.ingress.kubernetes.io/auth-signin"        = "https://oauth2.dev.audioprothese.ovh/oauth2/start?rd=$scheme://$host$escaped_request_uri"
-                                   "nginx.ingress.kubernetes.io/auth-url"           = "https://oauth2.dev.audioprothese.ovh/oauth2/auth"
-                                   "nginx.ingress.kubernetes.io/force-ssl-redirect" = "true"
                                }
-                               enabled          = true
-                               hosts            = [
-                                   "prometheus.dev.audioprothese.ovh",
                                ]
-                               ingressClassName = "webapprouting.kubernetes.azure.com"
-                               path             = "/"
-                               pathType         = "Prefix"
-                               tls              = [
-                                   {
-                                       hosts      = [
-                                           "prometheus.dev.audioprothese.ovh",
                                        ]
-                                       secretName = "prometheus-tls"
                                    },
                                ]
                            }
                        }
                    }
                )
-               version        = "72.5.0"
            },
        ] -> (known after apply)
        name                       = "prometheus-stack"
!~      values                     = [
!~          <<-EOT
                prometheus:
                  ingress:
                    enabled: true
                    ingressClassName: webapprouting.kubernetes.azure.com
                    hosts:
                      - prometheus.dev.audioprothese.ovh
                    path: /
                    pathType: Prefix
                    tls:
                      - hosts:
                          - prometheus.dev.audioprothese.ovh
                        secretName: prometheus-tls
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt-prod
                      nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                      nginx.ingress.kubernetes.io/auth-url: "https://oauth2.dev.audioprothese.ovh/oauth2/auth"
                      nginx.ingress.kubernetes.io/auth-signin: "https://oauth2.dev.audioprothese.ovh/oauth2/start?rd=$scheme://$host$escaped_request_uri"
                
                alertmanager:
                  ingress:
                    enabled: true
                    ingressClassName: webapprouting.kubernetes.azure.com
                    hosts:
                      - alertmanager.dev.audioprothese.ovh
                    path: /
                    pathType: Prefix
                
                grafana:
                  ingress:
                    enabled: true
                    annotations:
                      cert-manager.io/cluster-issuer: letsencrypt-prod
                      nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
                      nginx.ingress.kubernetes.io/auth-url: "https://oauth2.dev.audioprothese.ovh/oauth2/auth"
                      nginx.ingress.kubernetes.io/auth-signin: "https://oauth2.dev.audioprothese.ovh/oauth2/start?rd=$scheme://$host$escaped_request_uri"
              +       nginx.ingress.kubernetes.io/auth-response-headers: X-Auth-Request-User, X-Auth-Request-Email
                    labels: {}
                    path: /
                    pathType: Prefix
                    hosts:
                      - grafana.dev.audioprothese.ovh
                    tls:
                      - hosts:
                          - grafana.dev.audioprothese.ovh
                        secretName: grafana-tls
                    ingressClassName: "webapprouting.kubernetes.azure.com"
                  datasources:
                    datasources.yaml:
                      apiVersion: 1
                      datasources:
                        - name: Loki
                          type: loki
                          url: http://loki-gateway.loki.svc.cluster.local/
                
                  grafana.ini:
                    server:
                      root_url: "https://grafana.dev.audioprothese.ovh/"
                      domain: "grafana.dev.audioprothese.ovh"
                
                    auth:
                      disable_login_form: true
                      
                    auth.proxy:
                      enabled: true
              -       header_name: X-Email
              -       header_property: email  
              +       header_name: X-Auth-Request-Email
              +       header_property: email
                      auto_sign_up: true
                    
                    users:
                      auto_assign_org: true
                      auto_assign_org_role: Admin
            EOT,
        ]
!~      version                    = "72.5.0" -> "72.3.1"
#        (25 unchanged attributes hidden)
    }

  # kubectl_manifest.clustersecretstore will be created
+   resource "kubectl_manifest" "clustersecretstore" {
+       api_version             = "external-secrets.io/v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "ClusterSecretStoreecretStore"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "azure-cluster-secret-store"
+       namespace               = (known after apply)
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: external-secrets.io/v1
            kind: ClusterSecretStoreecretStore
            metadata:
              annotations:
                external-secrets.io/disable-maintenance-checks: "true"
              name: azure-cluster-secret-store
            spec:
              conditions:
              - namespaces:
                - monitoring
                - authgate
              provider:
                azurekv:
                  authType: WorkloadIdentity
                  serviceAccountRef:
                    name: workload-identity-sa
                  tenantId: b7b023b8-7c32-4c02-92a6-c8cdaa1d189c
                  vaultUrl: https://openmrs-dev-vault.vault.azure.net/
        EOT
+       yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.openmrs_ingress will be created
+   resource "kubectl_manifest" "openmrs_ingress" {
+       api_version             = "networking.k8s.io/v1"
+       apply_only              = false
+       force_conflicts         = false
+       force_new               = false
+       id                      = (known after apply)
+       kind                    = "Ingress"
+       live_manifest_incluster = (sensitive value)
+       live_uid                = (known after apply)
+       name                    = "openmrs-gateway-ingress"
+       namespace               = "openmrs"
+       server_side_apply       = false
+       uid                     = (known after apply)
+       validate_schema         = true
+       wait_for_rollout        = true
+       yaml_body               = (sensitive value)
+       yaml_body_parsed        = <<-EOT
            apiVersion: networking.k8s.io/v1
            kind: Ingress
            metadata:
              annotations:
                cert-manager.io/cluster-issuer: letsencrypt-prod
                nginx.ingress.kubernetes.io/force-ssl-redirect: "true"
              name: openmrs-gateway-ingress
              namespace: openmrs
            spec:
              ingressClassName: webapprouting.kubernetes.azure.com
              rules:
              - host: openmrs.dev.audioprothese.ovh
                http:
                  paths:
                  - backend:
                      service:
                        name: gateway
                        port:
                          number: 80
                    path: /
                    pathType: Prefix
              tls:
              - hosts:
                - openmrs.dev.audioprothese.ovh
                secretName: openmrs-tls
        EOT
+       yaml_incluster          = (sensitive value)
    }

Plan: 4 to add, 2 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create Terraform plan (DEV) #162](https://github.com/AudioProthese/openmrs-core-infrastructure/actions/runs/15196259125)